# num_str = "0123456789"
# # 1. 截取从 2 ~ 5 位置 的字符串
# print(num_str[2:6])
# # 2. 截取从 2 ~ `末尾` 的字符串
# print(num_str[2:])
# # 3. 截取从 `开始` ~ 5 位置 的字符串
# print(num_str[:6])
# # 4. 截取完整的字符串
# print(num_str[:])
# # 5. 从开始位置，每隔一个字符截取字符串
# print(num_str[::2])
# # 6. 从索引 1 开始，每隔一个取一个
# print(num_str[1:2])
# # 倒序切片
# # -1 表示倒数第一个字符
# print(num_str[-1::])
# # 7. 截取从 2 ~ `末尾 - 1` 的字符串
# print(num_str[2:])
# # 8. 截取字符串末尾两个字符
# print(num_str[-2::])
# # 9. 字符串的逆序
# print(num_str[::-1])

# #查方法())
# string="qwer"
# print(dir(string))
# help(string.isalpha
FirstName = """赵钱孙李，周吴郑王。
冯陈褚卫，蒋沈韩杨。
朱秦尤许，何吕施张。
孔曹严华，金魏陶姜。
戚谢邹喻，柏水窦章。
云苏潘葛，奚范彭郎。
鲁韦昌马，苗凤花方。
俞任袁柳，酆鲍史唐。
费廉岑薛，雷贺倪汤。"""

LastName = """恨桃、依秋、依波、香巧、紫萱、涵易、忆之、幻巧、水风、安寒、白亦、惜玉、碧春、怜雪、
听南、念蕾、紫夏、凌旋、芷梦、凌寒、梦竹、千凡、采波、元冬、思菱、平卉、笑柳、雪卉、南蓉、谷梦、
巧兰、绿蝶、飞荷、平安、芷荷、怀瑶、慕易、若芹、紫安、曼冬、寻巧、寄波、尔槐、以旋、初夏、依丝、
怜南、傲菡、谷蕊、笑槐、飞兰、笑卉、迎荷、元冬、痴安、妙绿、觅雪、寒安、沛凝、白容、乐蓉、映安、
依云、映冬、凡雁、梦秋、梦凡、秋巧、若云、元容、怀蕾、灵寒、天薇、翠安、乐琴、宛南、怀蕊、白风、
访波、亦凝、易绿、夜南、曼凡、亦巧、青易。冰真、白萱、友安、海之、小蕊、又琴、天风、若松、盼菡、
秋荷、香彤、语梦、惜蕊、迎彤、沛白、雁山、易蓉、雪晴、诗珊、春冬、又绿、冰绿、半梅、笑容、沛凝、
映秋、盼烟、晓凡、涵雁、问凝、冬萱、晓山、雁蓉、梦蕊、山菡、南莲、飞双、凝丝、思萱、怀梦、雨梅、
冷霜、向松、迎丝、迎梅、雅彤、香薇、以山、碧萱、寒云、向南、书雁、怀薇、思菱、忆文、翠巧、怀山、
若山、向秋、凡白、绮烟、从蕾、天曼、又亦、从安、绮彤、之玉、凡梅、依琴、沛槐、又槐、元绿、安珊、
夏之、易槐、宛亦、白翠、丹云、问寒、易文、傲易、青旋、思真、雨珍、幻丝、代梅、盼曼、妙之、半双、若翠"""
#随机五个人名
